/*
TODO:
    *   Пагинация брейнов
    *   Админка. Убрать "Добавить Администратора" и расширить функционал
    *   Верстка мой профиль, подвинуть под аватарку
    *   Добавить брейны в мой профиль
    *   Переверстать комментарии на Портале
    *   Выводить в комментарии дату и время
    *   Добавить возможность изменить аватар
    *   Рассмотреть вариант добавления градиента на главную страницу
    *   Мелкая верстка всего проекта, (красные рамки вокруг брейнов, и т.д.)
    *
    *
    *
    *   ЭКСТРА: реализовать поиск по брейнам
    *   ЭКСТРА: изменить модель комментариев, связать их с брейнами, чтобы выводить на них ссылку
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
 */